export default class MovieService {

        data = [
                {
                        id: 1,
                        title: 'Расьомон',
                        year: '1950',
                        text: '«Рашьомо́н» (яп. 羅生門, らしょうもん) — японський художній чорно-білий фільм 1950 року режисера Куросави Акіри за мотивами психологічно-історичних новел Акутаґави Рюноске «Рашьомон» та «В чагарнику»',
                        img: 'https://i.pinimg.com/originals/50/fc/95/50fc95abe9fa4da88bce448b1e0c2bbb.jpg',
                        price: '100'
                },

                {
                        id: 2,
                        title: 'Сім самураїв',
                        year: '1954',
                        text: '«Сім самураїв» (яп. 七人の侍 ) — японський фільм 1954 року, драма режисера Куросави Акіри. Фільм належить до класики японського та світового кіно, входить у список найвизначніших та найвпливовіших фільмів у історії світового кінематографу',
                        img: 'https://i.pinimg.com/originals/0f/02/2d/0f022d8fd19ca1e489972486585ac471.jpg',
                        price: '250'
                },
                {
                        id: 3,
                        title: 'Замок інтриг',
                        year: '1957',
                        text: '«За́мок інтриг» (яп. 蜘蛛巣城 ), у міжнародному прокаті — «Трон у крові»; відомий також як «Скривавлений трон» та «Кривавий трон» — японська чорно-біла історико-філософська драма 1957 року, поставлена режисером Акірою Куросавою за мотивами п"єси Вільяма Шекспіра «Макбет»',
                        img: 'https://i.pinimg.com/originals/da/8a/fe/da8afee24e3261288f0c62fff3da5049.jpg',
                        price: '75'
                },
                {
                        id: 4,
                        title: 'Ран',
                        year: '1985',
                        text: '«Ран» (яп. 乱 ) — японська епічна історична драма (дзідайґекі) 1985 року, поставлений режисером Акірою Куросавою. Сюжет стрічки засновано на легендах даймьо́ Морі Мотонарі, а також на трагедії Вільяма Шекспіра «Король Лір»',
                        img: 'https://upload.wikimedia.org/wikipedia/uk/2/2d/Ran_Akira_Kurosawa_1985.jpg',
                        price: '185'
                }
        ]

        getMovies() {
                return new Promise((resolve, reject) => {
                        setTimeout(() => {
                                resolve(this.data)
                                // reject(new Error('Oopes, smth went wrong'))
                        }, 700);
                });
        }
}